tap "argoproj/tap"
tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "jesseduffield/lazydocker"
tap "ringohub/redis-cli"
tap "superbrothers/zsh-kubectl-prompt"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Google's own build tool
brew "bazel"
# New way to see and navigate directory trees
brew "broot"
# Platform built on V8 to build network applications
brew "node"
# Define k8s native apps and abstractions using object-oriented programming
brew "cdk8s"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Generic library support script
brew "libtool"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Network authentication protocol
brew "krb5"
# Postgres C API library
brew "libpq", link: true
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Configurable talking characters in ASCII art
brew "cowsay"
# HTTP load testing application written in Rust
brew "drill"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# Like cURL, but for gRPC
brew "grpcurl"
# Manage compile and link flags for libraries
brew "pkg-config"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Istio configuration command-line utility
brew "istioctl"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes prompt info for bash and zsh
brew "kube-ps1"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php@7.4"
# Python dependency management tool
brew "pipenv"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Service monitoring system and time series database
brew "prometheus"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Secure and efficient FTP server
brew "pure-ftpd"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Monitors sleep, wakeup, and idleness of a Mac
brew "sleepwatcher"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform", link: false
# Terraform version manager inspired by rbenv
brew "tfenv"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Kubectl Argo Rollouts Plugin.
brew "argoproj/tap/kubectl-argo-rollouts"
# Copilot CLI - build, release and operate your container apps on AWS
brew "aws/tap/copilot-cli"
# Install the redis-cli only.
brew "ringohub/redis-cli/redis-cli"
# Display information about the kubectl current context and namespace in zsh prompt.
brew "superbrothers/zsh-kubectl-prompt/zsh-kubectl-prompt"
# Archive manager for data compression and backups
cask "rar"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
