tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "jesseduffield/lazydocker"
tap "ringohub/redis-cli"
tap "superbrothers/zsh-kubectl-prompt"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Google's own build tool
brew "bazel"
# New way to see and navigate directory trees
brew "broot"
# Platform built on V8 to build network applications
brew "node"
# Define k8s native apps and abstractions using object-oriented programming
brew "cdk8s"
# Postgres C API library
brew "libpq", link: true
# Dependency Manager for PHP
brew "composer"
# HTTP load testing application written in Rust
brew "drill"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Like cURL, but for gRPC
brew "grpcurl"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Istio configuration command-line utility
brew "istioctl"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes prompt info for bash and zsh
brew "kube-ps1"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php@7.4"
# Python dependency management tool
brew "pipenv"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Service monitoring system and time series database
brew "prometheus"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Secure and efficient FTP server
brew "pure-ftpd"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Monitors sleep, wakeup, and idleness of a Mac
brew "sleepwatcher"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Process YAML documents from the CLI
brew "yq"
# Copilot CLI - build, release and operate your container apps on AWS
brew "aws/tap/copilot-cli"
# Install the redis-cli only.
brew "ringohub/redis-cli/redis-cli"
# Display information about the kubectl current context and namespace in zsh prompt.
brew "superbrothers/zsh-kubectl-prompt/zsh-kubectl-prompt"
