tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "shivammathur/php"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Improved top (interactive process viewer)
brew "htop"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Compress/expand executable files
brew "upx"
# Vi 'workalike' with many additional features
brew "vim"
# General-purpose scripting language
brew "shivammathur/php/php"
