bat
bazel
berkeley-db
broot
brotli
c-ares
ca-certificates
cmake
exa
fzf
gdbm
gettext
go
grpcurl
helm
htop
icu4c
jemalloc
jq
krb5
kubeconform
kubernetes-cli
libev
libevent
libidn2
libnghttp2
libpq
libtermkey
libtool
libunistring
libuv
libvterm
libyaml
libzip
lua
luajit-openresty
luarocks
luv
m4
mpdecimal
msgpack
ncurses
neovim
nghttp2
node
oniguruma
openjdk@11
openssl@1.1
pcre
pcre2
perl
pkg-config
pre-commit
prometheus
pure
python@3.10
python@3.9
readline
ripgrep
six
sleepwatcher
sqlite
terraform
the_silver_searcher
tldr
tmux
trash
tree-sitter
unibilium
utf8proc
watch
wget
xz
yamllint
yq
zsh-async
zsh-kubectl-prompt
zstd
