apr
apr-util
argon2
aspell
autoconf
bat
berkeley-db
brotli
c-ares
curl
fontconfig
freetds
freetype
fzf
gd
gdbm
gettext
glib
gmp
htop
icu4c
jemalloc
jpeg
krb5
libev
libevent
libffi
libidn2
libpng
libpq
libsodium
libssh2
libtermkey
libtiff
libtool
libunistring
libuv
libvterm
libyaml
libzip
lua
luajit-openresty
luv
m4
mpdecimal
msgpack
ncurses
neovim
nghttp2
node
oniguruma
openldap
openssl@1.1
pcre
pcre2
perl
php
python@3.9
readline
ripgrep
rtmpdump
ruby
sqlite
telnet
terraform
the_silver_searcher
tidy-html5
tmux
unibilium
unixodbc
upx
utf8proc
vim
webp
xz
zstd
